# !pip install janome
from janome.tokenizer import Tokenizer

japanese_vocabulary = [
    "りょこう", "フランス", "来月", "休みの日", "ガーデニング", "たのしい", "そして", "ストレッチ",
    "おふろ", "だれ", "いろいろ", "しゅくだい", "何", "がっこう", "かじ", "しごと", "こども",
    "ソウル", "えいご", "コーチ", "オーストラリア", "が", "きょうだい", "さむい", "ゆき", "ココア",
    "ふゆ", "こんばん", "九月", "くもり", "あき", "休み", "はなび", "プール", "七月", "はれ",
    "なつ", "日", "うみ", "はる", "あめ", "てんき", "あたたかい", "きょう", "ちかく", "ごかぞく",
    "アレルギー", "でんわばんごう", "〇", "九", "きゅうきゅうしゃ", "びょういん", "けいさつ", "あぶない",
    "だいじょうぶ", "おみやげ", "おかし", "ポストカード", "はな", "高い", "山", "じんじゃ", "ラーメンや",
    "ピザや", "デザート", "あれ", "おてら", "たてもの", "な", "ところ", "ながい", "時間", "しゅうてん",
    "分", "ぐらい", "はやい", "十分", "つぎ", "バス", "でんしゃ", "つくえ", "れいぞうこ", "テーブル",
    "たぶん", "せまい", "キッチン", "ひろい", "いえ", "コメディ", "アクション", "ファンタジー", "ミステリー",
    "Kポップ", "ベトナム", "エリカ", "パスタ", "あした", "らいしゅう", "バレーボール", "まいしゅう",
    "四時", "何時に", "新聞", "ラジオ", "でぐち", "ちかい", "カフェ", "かいだん", "コンセント", "とおい",
    "でんわ", "タクシー", "エレベーター", "おてあらい", "ゴミばこ", "のりかえ", "あそこ", "かいさつ", "ホーム",
    "どうが", "じゅうどう", "テニス", "日曜日", "ゲーム", "からて", "土曜日", "スポーツ", "ヨガ", "ともだち",
    "ドラマ", "しゅうまつ", "アイスコーヒー", "こうちゃ", "小さい", "すこし", "サラダ", "そば", "大きい",
    "おにぎり", "ふたつ", "あ", "ひとつ", "水", "レストラン", "うどん", "てんぷら", "ジャケット", "たかい",
    "くろい", "みせ", "千", "いくら", "ネクタイ", "えん", "やすい", "百", "あの", "あおい", "いい", "ドレス",
    "スカート", "新しい", "Tシャツ", "ね", "ふく", "ダサい", "さいふ", "古い", "ばんごはん", "まいばん",
    "九時", "半", "八", "べんとう", "ひるごはん", "十二", "十", "十一", "あさごはん", "七時", "時", "たべます",
    "コーヒー", "まいあさ", "ジュース", "まいにち", "パン", "サンドイッチ", "Jポップ", "まんが", "アニメ",
    "やきゅう", "します", "ざっし", "本", "ニュース", "おんがく", "ロック", "ジャズ", "サッカー", "ときどき",
    "バスケットボール", "を", "よく", "えいが", "テレビ", "おっと", "七", "あたまがいい", "むすこ", "むすめ",
    "六", "つま", "だいがくせい", "ゆうめい", "かんごし", "おとうと", "うるさい", "五", "あに", "かいしゃいん",
    "あね", "四", "いもうと", "さい", "いそがしい", "エンジニア", "父", "かぞく", "母", "まち", "とても", "きれい",
    "しずか", "にぎやか", "とし", "日本", "おおさか", "京都", "ニューヨーク", "も", "私", "ようこそ", "おはようございます",
    "かばん", "田中", "パスポート", "の", "スマホ", "ちず", "きっぷ", "ちかてつ", "くうこう", "すみません", "いま",
    "一", "二", "三", "じ", "に", "いち", "おもしろい", "その", "かわいい", "この", "くつ", "しろい", "コート",
    "あかい", "ぼうし", "そこ", "だいがく", "えき", "デパート", "ここ", "バスてい", "ホテル", "コンビニ", "どこ",
    "ブラジルじん", "イギリスじん", "ブラジル", "イギリス", "にほんじん", "カナダ", "アメリカじん", "カナダじん",
    "アメリカ", "ちいさい", "にほん", "おおきい", "か", "いいえ", "はい", "ケーキ", "ピザ", "それ", "これ",
    "ラーメン", "おいしい", "は", "カレー", "じゃあね", "さん", "こんにちは", "がくせい", "ひと", "かっこいい",
    "べんごし", "やさしい", "せんせい", "いしゃ", "と", "みず", "ごはん", "すし", "ください", "おちゃ"
]

japanese_vocabulary_kanji = [
    "旅行", "楽しい", "お風呂", "色々", "宿題", "学校", "家事", "仕事", "子供",
    "寒い", "雪", "冬", "今晩", "曇り", "秋", "花火", "晴れ", "海", "春", "雨", "天気",
    "暖かい", "今日", "近く", "ご家族", "電話番号", "救急車", "病院", "警察", "危ない",
    "大丈夫", "お土産", "お菓子", "花", "高い", "山", "神社", "建物", "所", "長い", "時間",
    "終点", "分", "速い", "次", "机", "冷蔵庫", "キッチン", "広い", "家", "小さい", "少し",
    "蕎麦", "大きい", "二つ", "一つ", "水", "天ぷら", "高い", "黒い", "店",
    "千", "円", "安い", "百", "青い", "新しい", "服", "財布", "古い",
    "晩ご飯", "毎晩", "九時", "半", "八", "弁当", "昼ごはん", "十二", "十", "十一", "朝ごはん",
    "七時", "食べます", "毎朝", "毎日", "漫画", "野球", "雑誌", "本", "音楽", "時々", "映画",
    "夫", "頭がいい", "息子", "娘", "妻", "大学生", "有名", "看護師", "弟", "兄",
    "会社員", "姉", "妹", "歳", "忙しい", "家族", "町", "静か", "賑やか", "年",
    "大阪", "京都", "私", "地図", "切符", "地下鉄", "空港", "今",
    "面白い", "靴", "白い", "赤い", "帽子", "大学", "駅",
    "バス停", "ブラジル人", "イギリス人", "日本人", "友達",
    "アメリカ人", "カナダ人", "大きい", "美味しい", "学生", "人",
    "弁護士", "優しい", "先生", "医者", "寿司"
]

japanese_vocabulary_2 = [
    '。', '、', '行き', 'です', 'ます', 'もの', '帰り'
]

new_japanese_vocabulary = japanese_vocabulary + japanese_vocabulary_kanji + japanese_vocabulary_2

def analyze_passage(passage, vocabulary):
    tokenizer = Tokenizer()
    words = tokenizer.tokenize(passage, wakati=True)
    
    new_words = set()
    known_words = set()
    
    for word in words:
        if word in vocabulary:
            known_words.add(word)
        else:
            new_words.add(word)
    
    return known_words, new_words

# passage = "今月はフランスに行きます。来月はイギリスに行く予定です。"
passage = """昨日、私は友達と一緒に京都に行きました。私たちはまず、京都駅で待ち合わせをし、その後、駅近くのカフェで軽い朝ごはんを食べました。天気はとても良く、晴れた空が広がっていました。私たちはその後、山に登るために出発しました。
京都の山々は秋の紅葉で彩られており、風景がとても美しかったです。山の頂上に着くと、清々しい空気と壮大な景色が広がっていました。その後、神社を訪れて、お土産を買いました。お土産には、京都の伝統的なお菓子や手作りの工芸品がありました。
夕方には、地元のレストランで夕ごはんを食べました。料理はとても美味しく、特に天ぷらと蕎麦が絶品でした。食事の後、私たちは駅近くのデパートでショッピングを楽しみました。
帰りの電車は少し混んでいましたが、楽しい一日を過ごしたおかげで、疲れも吹き飛びました。家に帰ると、リラックスするためにお風呂に入るつもりです。今日の旅行は本当に素晴らしいものでした。"""
known_words, new_words = analyze_passage(passage, new_japanese_vocabulary)

print("Known words found:", known_words)
print("New words found:", new_words)
